In [62]:
import json
import os
import numpy as np
import pandas as pd
from sqlalchemy import create_engine
from sqlalchemy.sql import text

In [63]:
db_host = "localhost"
db_port = "3306"
db_user = "root"
db_pass = "Carrots123"

source_db = "sakila"
warehouse_db = "sakila_dw"

In [64]:
def load_data_from_mysql(user, password, host, database, query):
    connection_string = f"mysql+pymysql://{user}:{password}@{host}/{database}"
    engine = create_engine(connection_string, pool_recycle=3600)
    conn = engine.connect()
    result_df = pd.read_sql(query, conn)
    conn.close()
    return result_df


def write_data_to_mysql(user, password, host, database, dataframe, table, primary_key, operation):
    connection_string = f"mysql+pymysql://{user}:{password}@{host}/{database}"
    engine = create_engine(connection_string, pool_recycle=3600)
    conn = engine.connect()
    
    if operation == "insert":
        dataframe.to_sql(table, con=conn, index=False, if_exists='replace')
        conn.execute(text(f"ALTER TABLE {table} ADD PRIMARY KEY ({primary_key});"))
    
    elif operation == "update":
        dataframe.to_sql(table, con=conn, index=False, if_exists='append')
    
    conn.close()

In [65]:
conn_str = f"mysql+pymysql://{db_user}:{db_pass}@{db_host}"
engine = create_engine(conn_str, pool_recycle=3600)
conn = engine.connect()

conn.execute(text(f"DROP DATABASE IF EXISTS `{warehouse_db}`;"))
conn.execute(text(f"CREATE DATABASE `{warehouse_db}`;"))
conn.execute(text(f"USE {warehouse_db};"))

conn.close()

In [66]:
import pymysql
import pandas as pd

# Database connection settings
db_host = "localhost"
db_port = "3306"
db_user = "root"
db_pass = "Carrots123"

source_db = "sakila"
warehouse_db = "sakila_dw"

mysql_config = {
    "uid": "root",
    "pwd": "Carrots123",
    "hostname": "localhost",
    "dbname": "northwind_dw2"
}

# MongoDB connection settings
mongo_config = {
    "user_name": "sonia_sadani",
    "password": "password101",
    "cluster_name": "Cluster0",
    "cluster_subnet": "s7ikf",
    "cluster_location": "atlas",
    "db_name": "northwind_purchasing"
}

In [67]:
import certifi
import pymongo
import json
import pandas as pd

def connect_to_mongo(**config):
    if config["cluster_location"] not in ["atlas", "local"]:
        raise ValueError("cluster_location must be 'atlas' or 'local'")
    
    if config["cluster_location"] == "atlas":
        uri = f"mongodb+srv://{config['user_name']}:{config['password']}@"
        uri += f"{config['cluster_name']}.{config['cluster_subnet']}.mongodb.net"
        client = pymongo.MongoClient(uri, tlsCAFile=certifi.where())
    
    elif config["cluster_location"] == "local":
        client = pymongo.MongoClient("mongodb://localhost:27017/")
    
    return client

def load_collection_as_df(client, db, collection_name, filter_query):
    collection = client[db][collection_name]
    df = pd.DataFrame(list(collection.find(filter_query)))
    if "_id" in df.columns:
        df.drop(columns=["_id"], inplace=True)
    return df

In [68]:
#Run Create_Dim_Date file in SQL

In [69]:
language_query = "SELECT * FROM sakila.language;"
df_language = load_data_from_mysql(db_user, db_pass, db_host, source_db, language_query)
df_language.head(2)

   language_id     name         last_update
0            1  English 2006-02-15 05:02:19
1            2  Italian 2006-02-15 05:02:19

In [70]:
columns_to_remove = ['last_update']
df_language.drop(columns=columns_to_remove, inplace=True)

df_language.insert(0, "language_key", range(1, len(df_language) + 1))
df_language.head(2)

   language_key  language_id     name
0             1            1  English
1             2            2  Italian

In [71]:
df_film = pd.read_json("/Users/soniasadani/Downloads/film_data.json")
df_film.head(2)

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,NaN,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",1139979822000
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,1,NaN,3,4.99,48,12.99,G,"Trailers,Deleted Scenes",1139979822000

In [72]:
unneeded_columns = ['last_update']
df_film.drop(columns=unneeded_columns, inplace=True)

df_film.insert(0, "film_key", range(1, len(df_film) + 1))
df_film.head(2)

,film_key,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features
0,1,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,NaN,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes"
1,2,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,1,NaN,3,4.99,48,12.99,G,"Trailers,Deleted Scenes"

In [73]:
#import json
#with open("store_data.json", "r") as f:
    #store_data = json.load(f)

#collection = db["store"]
#collection.insert_many(store_data)

In [74]:
mongo_client = connect_to_mongo(**mongo_config)
store_query = {}
store_collection = "store"

df_store = load_collection_as_df(mongo_client, mongo_config["db_name"], store_collection, store_query)
df_store.head(2)

   store_id  manager_staff_id  address_id    last_update
0         1                 1           1  1139979432000
1         2                 2           2  1139979432000

In [75]:
columns_to_drop = ['last_update']
df_store.drop(columns=columns_to_drop, inplace=True)

df_store.insert(0, "store_key", range(1, len(df_store) + 1))
df_store.head(2)

   store_key  store_id  manager_staff_id  address_id
0          1         1                 1           1
1          2         2                 2           2

In [76]:
operation_type = "insert"

dimension_tables = [
    ('dim_film', df_film, 'film_key'),
    ('dim_store', df_store, 'store_key'),
    ('dim_langauge', df_language, 'language_key')
]

for table, df, pk in dimension_tables:
    write_data_to_mysql(db_user, db_pass, db_host, warehouse_db, df, table, pk, operation_type)

In [77]:
rental_query = "SELECT * FROM sakila.rental;"
df_fact_rentals = load_data_from_mysql(db_user, db_pass, db_host, source_db, rental_query)
df_fact_rentals.drop(columns=['last_update'], inplace=True)

inventory_query = "SELECT inventory_id, film_id, store_id FROM sakila.inventory;"
df_inventory = load_data_from_mysql(db_user, db_pass, db_host, source_db, inventory_query)

df_fact_rentals = pd.merge(df_fact_rentals, df_inventory, on='inventory_id', how='left')
df_fact_rentals = pd.merge(df_fact_rentals, df_film[['film_id', 'language_id']], on='film_id', how='left')
df_fact_rentals = pd.merge(df_fact_rentals, df_language[['language_id', 'language_key']], on='language_id', how='left')
df_fact_rentals.drop(columns=['language_id'], inplace=True)

In [79]:
date_query = "SELECT date_key, full_date FROM sakila_dw.dim_date;"
df_dim_date = load_data_from_mysql(db_user, db_pass, db_host, source_db, date_query)
df_dim_date["full_date"] = df_dim_date["full_date"].astype('datetime64[ns]').dt.date

In [80]:
df_fact_rentals["rental_date"] = df_fact_rentals["rental_date"].astype("datetime64[ns]").dt.date

rental_date_dim = df_dim_date.rename(columns={
    "date_key": "rental_date_key",
    "full_date": "rental_date"
})

df_fact_rentals = pd.merge(df_fact_rentals, rental_date_dim, on="rental_date", how="left")

In [81]:
store_lookup_query = "SELECT store_key, store_id FROM sakila_dw.dim_store;"
df_dim_store = load_data_from_mysql(db_user, db_pass, db_host, warehouse_db, store_lookup_query)

df_fact_rentals = pd.merge(df_fact_rentals, df_dim_store, on="store_id", how="inner")
df_fact_rentals.drop(columns=["store_id"], inplace=True)

In [82]:
film_lookup_query = "SELECT film_key, film_id FROM sakila_dw.dim_film;"
df_dim_film = load_data_from_mysql(db_user, db_pass, db_host, warehouse_db, film_lookup_query)

df_fact_rentals = pd.merge(df_fact_rentals, df_dim_film, on="film_id", how="inner")
df_fact_rentals.drop(columns=["film_id"], inplace=True)

In [83]:
selected_columns = ['rental_id', 'store_key', 'film_key', 'language_key', 'rental_date_key']
df_fact_rentals = df_fact_rentals[selected_columns]

df_fact_rentals.insert(0, "fact_rental_key", range(1, len(df_fact_rentals) + 1))
df_fact_rentals.head(2)

,fact_rental_key,rental_id,store_key,film_key,language_key,rental_date_key
0,1,1,1,80,1,20050524
1,2,1,3,80,1,20050524

In [84]:
fact_table = "fact_rentals"
fact_pk = "fact_rental_key"
operation = "insert"

write_data_to_mysql(db_user, db_pass, db_host, warehouse_db, df_fact_rentals, fact_table, fact_pk, operation)

In [96]:
#SQL Queries

In [97]:
from sqlalchemy import create_engine

engine = create_engine("mysql+pymysql://root:Carrots123@localhost/sakila_dw")

In [103]:
# Query: Count the number of rentals grouped by language
# This joins the fact_rentals table with the dim_langauge table to get the language name,
# then counts how many rentals were made in each language.
query = """
SELECT lang.name AS language_name, COUNT(*) AS rentals_count
FROM fact_rentals AS f
JOIN dim_langauge AS lang ON f.language_key = lang.language_key
GROUP BY lang.name;
"""

# Execute the SQL query and load the result into a DataFrame
df_result = pd.read_sql(query, engine.connect())  # ensure engine is connected to sakila_dw
df_result.head()

  language_name  rentals_count
0       English          32088

In [104]:
# Query: Count the number of rentals per day
# This joins fact_rentals with dim_date to match each rental to its full date,
# then groups by that date and counts how many rentals occurred each day.
query_daily_rentals = """
SELECT dt.full_date AS rental_day, COUNT(f.fact_rental_key) AS rentals_per_day
FROM fact_rentals AS f
JOIN dim_date AS dt ON f.rental_date_key = dt.date_key
GROUP BY dt.full_date
ORDER BY dt.full_date ASC;
"""

# Execute the query and load the results into a DataFrame
df_daily_rentals = pd.read_sql(query_daily_rentals, engine.connect())
df_daily_rentals.head()

   rental_day  rentals_per_day
0  2005-05-24               16
1  2005-05-25              274
2  2005-05-26              348
3  2005-05-27              332
4  2005-05-28              392

In [105]:
# Query: Count the number of rentals per store
# This joins fact_rentals with dim_store to get each store’s ID,
# then counts how many rentals were processed by each store.
query_store_rentals = """
SELECT store.store_id, COUNT(f.fact_rental_key) AS num_rentals
FROM fact_rentals AS f
JOIN dim_store AS store ON f.store_key = store.store_key
GROUP BY store.store_id;
"""

# Run the query and return the results in a DataFrame
df_store_rentals = pd.read_sql(query_store_rentals, engine.connect())
df_store_rentals.head()

   store_id  num_rentals
0         1        15846
1         2        16242